BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny3214.PIC
        <edc:SFRDef edc:_addr="0xA06" edc:access="----nnnn" edc:cname="CTRLFCLR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
              <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP0BV" edc:desc="Compare 0 Buffer Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1BV" edc:desc="Compare 1 Buffer Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2BV" edc:desc="Compare 2 Buffer Valid" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA07" edc:access="----nnnn" edc:cname="CTRLFSET" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
              <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP0BV" edc:desc="Compare 0 Buffer Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1BV" edc:desc="Compare 1 Buffer Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2BV" edc:desc="Compare 2 Buffer Valid" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xA08" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xA09" edc:access="-----nnn" edc:cname="EVCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
              <edc:SFRFieldDef edc:cname="CNTEI" edc:desc="Count on Event Input" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVACT" edc:desc="Event Action" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="POSEDGE" edc:desc="Count on positive edge event" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ANYEDGE" edc:desc="Count on any edge event" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="HIGHLVL" edc:desc="Count on prescaled clock while event line is 1." edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1." edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA0A" edc:access="-nnn---n" edc:cname="INTCTRL" edc:impl="0x71" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
              <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare 2 Interrupt" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA0B" edc:access="-nnn---n" edc:cname="INTFLAGS" edc:impl="0x71" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
              <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare 2 Interrupt" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xA0C" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xA0E" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA0F" edc:access="nnnnnnnn" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
        <edc:AdjustPoint edc:_addr="0xA10" edc:offset="0x10"/>
        <edc:SFRDef edc:_addr="0xA20" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNT" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:AdjustPoint edc:_addr="0xA22" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0xA26" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PER" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:SFRDef edc:_addr="0xA28" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMP0" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:SFRDef edc:_addr="0xA2A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMP1" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:SFRDef edc:_addr="0xA2C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMP2" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:AdjustPoint edc:_addr="0xA2E" edc:offset="0x8"/>
        <edc:SFRDef edc:_addr="0xA36" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PERBUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:SFRDef edc:_addr="0xA38" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMP0BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:SFRDef edc:_addr="0xA3A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMP1BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:SFRDef edc:_addr="0xA3C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMP2BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
        <edc:AdjustPoint edc:_addr="0xA3E" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xA40" edc:access="-n-n-nnn" edc:cname="CTRLA" edc:impl="0x57" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="Clock Select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="CLKDIV1" edc:desc="CLK_PER (No Prescaling)" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="CLKDIV2" edc:desc="CLK_PER/2 (From Prescaler)" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="CLKTCA" edc:desc="Use Clock from TCA" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNCUPD" edc:desc="Synchronize Update" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run Standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
